## 🏗️ Azure Terraform Plan - dev

```terraform
Acquiring state lock. This may take a few moments...
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg]
azurerm_log_analytics_workspace.main: Refreshing state... [id=/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg/providers/Microsoft.OperationalInsights/workspaces/databro-dev-logs]
azurerm_container_app_environment.main: Refreshing state... [id=/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg/providers/Microsoft.App/managedEnvironments/databro-dev-env]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_app.api_gateway will be created
  + resource "azurerm_container_app" "api_gateway" {
      + container_app_environment_id  = "/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg/providers/Microsoft.App/managedEnvironments/databro-dev-env"
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "api-gateway"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "databro-dev-rg"
      + revision_mode                 = "Single"

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 80
          + transport                  = "auto"

          + custom_domain (known after apply)

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = 0
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.5
              + ephemeral_storage = (known after apply)
              + image             = "mcr.microsoft.com/k8se/quickstart:latest"
              + memory            = "1.0Gi"
              + name              = "api-gateway"

              + env {
                  + name  = "LLM_SERVICE_URL"
                  + value = "http://llm-service"
                }
              + env {
                  + name  = "RAG_SERVICE_URL"
                  + value = "http://rag-service"
                }
            }
        }
    }

  # azurerm_container_app.llm_service will be created
  + resource "azurerm_container_app" "llm_service" {
      + container_app_environment_id  = "/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg/providers/Microsoft.App/managedEnvironments/databro-dev-env"
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "llm-service"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "databro-dev-rg"
      + revision_mode                 = "Single"

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = false
          + fqdn                       = (known after apply)
          + target_port                = 11434
          + transport                  = "auto"

          + custom_domain (known after apply)

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = 0
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 2
              + ephemeral_storage = (known after apply)
              + image             = "ollama/ollama:latest"
              + memory            = "4.0Gi"
              + name              = "ollama"
            }
        }
    }

  # azurerm_container_app.rag_service will be created
  + resource "azurerm_container_app" "rag_service" {
      + container_app_environment_id  = "/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg/providers/Microsoft.App/managedEnvironments/databro-dev-env"
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "rag-service"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "databro-dev-rg"
      + revision_mode                 = "Single"

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = false
          + fqdn                       = (known after apply)
          + target_port                = 80
          + transport                  = "auto"

          + custom_domain (known after apply)

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = 0
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 1
              + ephemeral_storage = (known after apply)
              + image             = "mcr.microsoft.com/k8se/quickstart:latest"
              + memory            = "2.0Gi"
              + name              = "rag-service"
            }
        }
    }

  # azurerm_container_app.speech_service will be created
  + resource "azurerm_container_app" "speech_service" {
      + container_app_environment_id  = "/subscriptions/5936cfd6-540b-41c5-b5a7-a62d58112373/resourceGroups/databro-dev-rg/providers/Microsoft.App/managedEnvironments/databro-dev-env"
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "speech-service"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "databro-dev-rg"
      + revision_mode                 = "Single"

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = false
          + fqdn                       = (known after apply)
          + target_port                = 80
          + transport                  = "auto"

          + custom_domain (known after apply)

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = 0
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 1
              + ephemeral_storage = (known after apply)
              + image             = "mcr.microsoft.com/k8se/quickstart:latest"
              + memory            = "2.0Gi"
              + name              = "speech-service"
            }
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

**Plan Status**: success
**Validation**: success
**Format**: success